---
kind: property
id: P:Autodesk.Revit.DB.ScheduleSortGroupField.ShowFooter
source: html/53ee5050-034f-a9bc-d641-120618212714.htm
---
# Autodesk.Revit.DB.ScheduleSortGroupField.ShowFooter Property

Indicates if a footer row should be displayed after each group.

## Syntax (C#)
```csharp
public bool ShowFooter { get; set; }
```

## Remarks
The footer row displays totals of each field for which
 totals are enabled. It can also optionally display a title
 (see ShowFooterTitle) and a count of elements
 (see ShowFooterCount).